# фаил с переменными, содержащих str значения, для читабильности кода в других файлах


menu_text = '''Приветствуем в боте для бота единого государственного экзамена! 🤓\n
Чтобы начать использовать бота, выберите необходимый раздел.\nВы можете написать "Теория" или "Практика", а можете нажать на кнопки снизу.\n\nУдачи!'''

alg_log = '''Алгебра логики (алгебра высказываний) — раздел математической логики, в котором изучаются логические операции над высказываниями. 
Чаще всего предполагается, что высказывания могут быть только истинными или ложными, то есть используется так называемая бинарная или двоичная логика, в отличие от, например, троичной логики.'''

py = '''Python — высокоуровневый язык программирования общего назначения с динамической типизацией и автоматическим 
управлением памятью, ориентированный на повышение производительности разработчика, 
читаемости кода и его качества, а также на обеспечение переносимости написанных на нём программ. 
Синтаксис ядра языка минималистичен, за счёт чего на практике редко возникает необходимость обращаться к документации '''

ss = '''Система счисления — символический метод записи чисел, представление чисел с помощью письменных знаков.'''

gr = '''Графом называется конечное множество вершин и множество ребер. Каждому ребру сопоставлены две вершины – концы ребра.'''

cb = '''Комбинаторика — это область математики, прежде всего связанная с подсчетом, как средство и цель получения результатов, так и с определением свойств конечных структур.'''

begin = '''Перед Вами несколько тем, которые очень важны как для жизни, так и для экзамена 📖\n\nВыберите одну из тем, которую желаете изучить прямо сейчас.\nВ этот блок Вы сможете еще вернуться'''
black_begin = '''Что ж, если Вы знакомы со всеми темами, то можете потренироваться по каждой из них самостоятельно, а также получить подробное решение''' 

channel_1 = '''❗️ Напишите «/1», если нужно опубликовать видео-ролики с канала \nИТ-класс в московской школе 🖥🖱\n\n❗️ Напишите «/2», если нужно опубликовать видео-ролики с канала \nГБОУ Школа в Капотне г. Москва 🏫'''
help_11 = '''ℹ️ Это учебный бот, в нем изучаются важные темы, а полученные знания закрепляются практикой\n\nℹ️ Бота можно добавить в свой канал, предоставив ему административный доступ к ресурсу.\nВ канале можно будет получить дополнительную информацию,\nнаписав «/help»'''